JayHeng/RT-MFB/devices/MIMXRT1189/drivers/netc_hw/fsl_netc_hw.c
    status_t status = kStatus_Success;
    uint16_t curIndex;

    if ((!cbdr->bdrEnable) || (cbdr->cleanIndex == (cbdr->producerIndex + 1U) % cbdr->bdLength))
    {
        /* Selected BD ring is disable or full */
        status = kStatus_InvalidArgument;
    }

    if (kStatus_Success == status)
    {
        if (version == kNETC_NtmpV2_0)
        {
            if (((uintptr_t)cbd->req.addr % 16U) != 0U)
            {
                /* The request and response data buffers start address must be 16-byte aligned */
                return kStatus_InvalidArgument;
            }
            else
            {
                cbd->req.version = 0x2;
                cbd->req.npf     = 1;
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
                cbd->req.addr = (uintptr_t)MEMORY_ConvertMemoryMapAddress((uint32_t)cbd->req.addr, kMEMORY_Local2DMA);
#endif
            }
        }
        curIndex = cbdr->producerIndex;
        /* Copy command data to ring */
        cbdr->bdBase[curIndex] = *cbd;
        /* Update BD ring producer index */
        cbdr->producerIndex = (curIndex + 1U) % cbdr->bdLength;

        /* Make sure all data in the command BD is ready. */
        __DSB();
        /* Let hardware know command BD has been added */
        base->CBDRPIR = ((uint32_t)curIndex + 1U) % cbdr->bdLength;

        /* Wait until the command is execution completed */
        while (cbdr->producerIndex != base->CBDRCIR)
        {
        }

        /* Copy command BD responses data */
        *cbd = cbdr->bdBase[curIndex];
        /* Clean the unused BDs */
        EP_CleanUsedBD(base, cbdr);
        /* Return detail error status if not run success */
        if (version == kNETC_NtmpV2_0)
        {
            if (cbd->resp.error != 0U)
            {
                status = (status_t)cbd->resp.error;
            }
        }
        else
        {
            if (cbd->generic.status != 0U)
            {
                status = (status_t)cbd->generic.status;
            }
        }
    }

    return status;
}

status_t NETC_AddIPFTableEntry(netc_cbdr_handle_t *handle, netc_tb_ipf_config_t *config, uint32_t *entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_ipf_req_data_t));
    /* Add entry to IPF Table and query the ENTRY_ID */
    handle->buffer->ipf.request.cfge = config->cfge;
    handle->buffer->ipf.request.keye = config->keye;
    handle->buffer->ipf.request.commonHeader.updateActions =
        (uint16_t)kNETC_IPFStsEUpdate | (uint16_t)kNETC_IPFCfgEUpdate;
    handle->buffer->ipf.request.commonHeader.queryActions = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_ipf_req_data_t);
    cmdBd.req.resLength                                   = sizeof(netc_tb_ipf_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_IPFTable;
    cmdBd.req.cmd                                         = kNETC_AddAndQueryEntry;
    /* Add operation only support Ternary Match Key Element Match */
    cmdBd.req.accessType = kNETC_TernaryKeyMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *entryID = handle->buffer->ipf.response.entryID;
    }
    return status;
}

status_t NETC_UpdateIPFTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_ipf_cfge_t *cfg)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_ipf_req_data_t));
    /* Update entry in IPF Table base on the ENTRY_ID */
    handle->buffer->ipf.request.cfge    = *cfg;
    handle->buffer->ipf.request.entryID = entryID;
    handle->buffer->ipf.request.commonHeader.updateActions =
        (uint16_t)kNETC_IPFStsEUpdate | (uint16_t)kNETC_IPFCfgEUpdate;
    handle->buffer->ipf.request.commonHeader.queryActions = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_ipf_req_data_t);
    cmdBd.req.resLength                                   = sizeof(netc_tb_ipf_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_IPFTable;
    cmdBd.req.cmd                                         = kNETC_UpdateEntry;
    cmdBd.req.accessType                                  = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_DelIPFTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_ipf_req_data_t));
    handle->buffer->ipf.request.entryID                    = entryID;
    handle->buffer->ipf.request.commonHeader.updateActions = 0;
    handle->buffer->ipf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_ipf_req_data_t);
    cmdBd.req.resLength                                    = 4U;
    cmdBd.req.tableId                                      = kNETC_IPFTable;
    cmdBd.req.cmd                                          = kNETC_DeleteEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_ResetIPFMatchCounter(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_ipf_req_data_t));
    handle->buffer->ipf.request.entryID                    = entryID;
    handle->buffer->ipf.request.commonHeader.updateActions = (uint16_t)kNETC_IPFStsEUpdate;
    handle->buffer->ipf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_ipf_req_data_t);
    cmdBd.req.resLength                                    = 4U;
    cmdBd.req.tableId                                      = kNETC_IPFTable;
    cmdBd.req.cmd                                          = kNETC_UpdateEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_GetIPFMatchedCount(netc_cbdr_handle_t *handle, uint32_t entryID, uint64_t *count)
{
    status_t status     = kStatus_Success;
    netc_cmd_bd_t cmdBd = {0};

    (void)memset(handle->buffer, 0, sizeof(netc_tb_ipf_req_data_t));
    handle->buffer->ipf.request.entryID                    = entryID;
    handle->buffer->ipf.request.commonHeader.updateActions = 0U;
    handle->buffer->ipf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_ipf_keye_t) + 4U;
    cmdBd.req.resLength                                    = sizeof(netc_tb_ipf_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_IPFTable;
    cmdBd.req.cmd                                          = kNETC_QueryEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *count = ((uint64_t)handle->buffer->ipf.response.stse.matchCount[1] << 32U) |
                 handle->buffer->ipf.response.stse.matchCount[0];
    }
    return status;
}

status_t NETC_AddISITableEntry(netc_cbdr_handle_t *handle, netc_tb_isi_config_t *config, uint32_t *entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    /* Add entry to ISI Table and query the ENTRY_ID */
    handle->buffer->isi.request.cfge                       = config->cfge;
    handle->buffer->isi.request.keye                       = config->keye;
    handle->buffer->isi.request.commonHeader.updateActions = 1U;
    /* Query ENTRY_ID only */
    handle->buffer->isi.request.commonHeader.queryActions = 1U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_isi_req_data_t);
    cmdBd.req.resLength                                   = sizeof(netc_tb_isi_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_ISITable;
    cmdBd.req.cmd                                         = kNETC_AddAndQueryEntry;
    /* Add operation only support Exact Match Key Element Match */
    cmdBd.req.accessType = kNETC_ExactKeyMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *entryID = handle->buffer->isi.response.entryID;
    }

