JayHeng/RT-MFB/devices/MIMXRT1189/drivers/netc_hw/fsl_netc_hw.c
    return status;
}

status_t NETC_DelISITableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    handle->buffer->isi.request.entryID                    = entryID;
    handle->buffer->isi.request.commonHeader.updateActions = 0;
    handle->buffer->isi.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = 24U;
    cmdBd.req.resLength                                    = 4U;
    cmdBd.req.tableId                                      = kNETC_ISITable;
    cmdBd.req.cmd                                          = kNETC_DeleteEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_AddOrUpdateISTableEntry(netc_cbdr_handle_t *handle, netc_tb_is_config_t *config, bool isAdd)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    /* Add or Update entry in IS Table */
    handle->buffer->is.request.cfge                       = config->cfge;
    handle->buffer->is.request.entryID                    = config->entryID;
    handle->buffer->is.request.commonHeader.updateActions = 1U;
    handle->buffer->is.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_is_req_data_t);
    cmdBd.req.resLength                                   = sizeof(netc_tb_is_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_ISTable;
    if (isAdd)
    {
        cmdBd.req.cmd = kNETC_AddEntry;
    }
    else
    {
        cmdBd.req.cmd = kNETC_UpdateEntry;
    }
    /* Only support ID Match Key Element Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_DelISTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_is_req_data_t));
    handle->buffer->is.request.entryID                    = entryID;
    handle->buffer->is.request.commonHeader.updateActions = 0;
    handle->buffer->is.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = 8U;
    cmdBd.req.resLength                                   = 0U;
    cmdBd.req.tableId                                     = kNETC_ISTable;
    cmdBd.req.cmd                                         = kNETC_DeleteEntry;
    cmdBd.req.accessType                                  = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_AddISFTableEntry(netc_cbdr_handle_t *handle, netc_tb_isf_config_t *config, uint32_t *entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    /* Add entry to ISF Table and query the ENTRY_ID */
    handle->buffer->isf.request.cfge                       = config->cfge;
    handle->buffer->isf.request.keye                       = config->keye;
    handle->buffer->isf.request.commonHeader.updateActions = 1U;
    /* Query ENTRY_ID only */
    handle->buffer->isi.request.commonHeader.queryActions = 1U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_isf_req_data_t);
    cmdBd.req.resLength                                   = sizeof(netc_tb_isf_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_ISFTable;
    cmdBd.req.cmd                                         = kNETC_AddAndQueryEntry;
    /* Add operation only support Exact Match Key Element Match */
    cmdBd.req.accessType = kNETC_ExactKeyMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *entryID = handle->buffer->isf.response.entryID;
    }

    return status;
}

status_t NETC_UpdateISFTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_isf_cfge_t *cfg)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    /* Update entry in ISF Table base on the ENTRY_ID */
    handle->buffer->isf.request.cfge                       = *cfg;
    handle->buffer->isf.request.entryID                    = entryID;
    handle->buffer->isf.request.commonHeader.updateActions = 1U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isf_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isf_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISFTable;
    cmdBd.req.cmd                                          = kNETC_UpdateEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_DelISFTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isf_req_data_t));
    handle->buffer->isf.request.entryID                    = entryID;
    handle->buffer->isf.request.commonHeader.updateActions = 0;
    handle->buffer->isf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = 12U;
    cmdBd.req.resLength                                    = 4U;
    cmdBd.req.tableId                                      = kNETC_ISFTable;
    cmdBd.req.cmd                                          = kNETC_DeleteEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_AddISCTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    /* Add entry to ISC Table according to the ENTRY_ID (ISC_EID) */
    handle->buffer->isc.request.entryID                    = entryID;
    handle->buffer->isc.request.commonHeader.updateActions = 0U;
    handle->buffer->isc.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isc_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isc_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISCTable;
    cmdBd.req.cmd                                          = kNETC_AddEntry;
    /* Only support ID Match Key Element Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_GetISCStatistic(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_isc_stse_t *statistic)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isc_req_data_t));
    handle->buffer->isc.request.entryID                    = entryID;
    handle->buffer->isc.request.commonHeader.updateActions = 0U;
    handle->buffer->isc.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isc_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isc_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISCTable;
    cmdBd.req.cmd                                          = kNETC_QueryEntry;
    /* Only support ID Match Key Element Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *statistic = handle->buffer->isc.response.stse;
    }
    return status;
}

status_t NETC_ResetISCStatistic(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isc_req_data_t));
    /* Reset ISC Table according to the ENTRY_ID (ISC_EID) */
    handle->buffer->isc.request.entryID                    = entryID;
    handle->buffer->isc.request.commonHeader.updateActions = 1U;
    handle->buffer->isc.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isc_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isc_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISCTable;
    cmdBd.req.cmd                                          = kNETC_UpdateEntry;
    /* Only support ID Match Key Element Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

